{
  "provider": "newsapi",
  "status": "ok",
  "totalResults": 47370,
  "articles": [
    {
      "title": "Here's How You Can Earn $100 In Passive Income By Investing In Becton Dickinson Stock",
      "description": "Becton, Dickinson and Co. (NYSE:BDX) is a multinational medical technology company that manufactures and sells medical devices, instruments, and reagents for...",
      "source": "Yahoo Entertainment",
      "url": "https://finance.yahoo.com/news/heres-earn-100-passive-income-122302865.html",
      "published_at": "2025-10-12T12:23:02Z",
      "author": "David Kirakosyan",
      "image_url": "https://media.zenfs.com/en/benzinga_79/243991432441d3dea814a492ed56a9f1",
      "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\r\nBecton, Dickinson and Co. (NYSE:BDX) is a multinational medical technology company that manufactu… [+3754 chars]"
    },
    {
      "title": "As AI-Bubble Fears Spread, a $35 Billion Fund Manager Positions for Inflows",
      "description": "Impax Asset Management Group is positioned to benefit should concerns about an AI-driven bubble trigger a sudden shift away from Big Tech, its chief executive said.",
      "source": "Financial Post",
      "url": "https://financialpost.com/pmn/business-pmn/as-ai-bubble-fears-spread-a-35-billion-fund-manager-positions-for-inflows",
      "published_at": "2025-10-12T12:22:06Z",
      "author": "Bloomberg News",
      "image_url": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/10/is-it-a-bubble-.jpg",
      "content": "(Bloomberg) Impax Asset Management Group is positioned to benefit should concerns about an AI-driven bubble trigger a sudden shift away from Big Tech, its chief executive said.\r\nTHIS CONTENT IS RESER… [+4875 chars]"
    },
    {
      "title": "Got a PS5, Xbox, or Switch? This Portable Monitor Going for Pennies Lets You Play Anywhere",
      "description": "Perfect for console gaming on the go, and just as handy as a second screen for your work laptop.\nThe post Got a PS5, Xbox, or Switch? This Portable Monitor Going for Pennies Lets You Play Anywhere appeared first on Kotaku.",
      "source": "Kotaku",
      "url": "https://kotaku.com/got-a-ps5-xbox-or-switch-this-portable-monitor-going-for-pennies-lets-you-play-anywhere-2000634469",
      "published_at": "2025-10-12T12:21:00Z",
      "author": "Kotaku Deals",
      "image_url": "https://kotaku.com/app/uploads/2025/08/mnn-portable-monitor-fhd-1200x675.jpg",
      "content": "Gaming on your Switch’s built-in screen is fine for short bursts, but after an hour of Mario Kart or Zelda, your eyes start begging for mercy. And if you’re living in a dorm room or apartment without… [+3036 chars]"
    },
    {
      "title": "Apple Is Going Nuts, The MacBook Air 2025 Is Now Cheaper Than a Random Mid-Range Windows Laptop",
      "description": "An official (and new) MacBook Air has never been this cheap.\nThe post Apple Is Going Nuts, The MacBook Air 2025 Is Now Cheaper Than a Random Mid-Range Windows Laptop appeared first on Kotaku.",
      "source": "Kotaku",
      "url": "https://kotaku.com/apple-is-going-nuts-the-macbook-air-2025-is-now-cheaper-than-a-random-mid-range-windows-laptop-2000634464",
      "published_at": "2025-10-12T12:11:26Z",
      "author": "Kotaku Deals",
      "image_url": "https://kotaku.com/app/uploads/2025/09/Apple-2025-MacBook-Air-13-inch-Laptop-with-M4-chip-1200x675.jpg",
      "content": "You know that feeling when you walk past an Apple Store and imagine what it would be like to own one of those sleek MacBooks but then you remember your budget and keep walking? That mental barrier ju… [+2283 chars]"
    },
    {
      "title": "The new corner office is at home",
      "description": "We're Columbia Business School professors and we know there’s no shortage of felt unfairness in the workplace, especially when it comes to remote work.",
      "source": "Fortune",
      "url": "https://fortune.com/2025/10/12/the-new-corner-office-is-at-home-remote-work-status-inequality/",
      "published_at": "2025-10-12T12:05:00Z",
      "author": "Stephan Meier, Joel Brockner",
      "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/10/GettyImages-2171207102-e1759894729713.jpg?resize=1200,600",
      "content": "For decades, a seemingly trivial issue who gets the best parking spot and office has ignited officewide tension. Employees grumble over who gets to park where and how offices were allocated (or who g… [+5101 chars]"
    },
    {
      "title": "The 40 jobs ‘most at risk of being replaced by AI’",
      "description": "The 40 jobs most at risk of being replaced by artificial intelligence have been revealed.",
      "source": "LADbible",
      "url": "https://www.ladbible.com/news/technology/ai-jobs-at-risk-technology-microsoft-405782-20251012",
      "published_at": "2025-10-12T12:02:21Z",
      "author": "James Moorhouse",
      "image_url": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blteda1e30bad079cab/68eb8b9c878ecf726c2b0631/artificial-intelligence-jobs-risk.jpg",
      "content": "The 40 jobs most at risk of being replaced by artificial intelligence have been revealed by Microsoft.\r\nAI has proven itself to have many uses in everyday life but it's getting smarter by the day, wi… [+2561 chars]"
    },
    {
      "title": "ChatGPT 5 Can Now Connect Every Tool You Use",
      "description": "Have you ever wished your tools could talk to each other, seamlessly sharing data, automating repetitive tasks, and freeing you to focus on the work that truly matters? Imagine updating a CAD design based on data from SAP without lifting a finger or juggling …",
      "source": "Geeky Gadgets",
      "url": "https://www.geeky-gadgets.com/chatgpt-apps-and-tool-integration/",
      "published_at": "2025-10-12T12:01:25Z",
      "author": "Julian Horsey",
      "image_url": "https://www.geeky-gadgets.com/wp-content/uploads/2025/10/chatgpt-integrating-tools_optimized.jpg",
      "content": "Have you ever wished your tools could talk to each other, seamlessly sharing data, automating repetitive tasks, and freeing you to focus on the work that truly matters? Imagine updating a CAD design … [+7431 chars]"
    },
    {
      "title": "Ethernet vs Wi-Fi security comparison reveals surprising results for home users seeking protection",
      "description": "Expert analysis reveals whether wired Ethernet or wireless Wi-Fi connections are safer for home internet use, plus practical steps to secure your network from attackers.",
      "source": "Fox News",
      "url": "https://www.foxnews.com/tech/ethernet-vs-wi-fi-security-comparison-reveals-surprising-results-home-users-seeking-protection",
      "published_at": "2025-10-12T12:00:40Z",
      "author": null,
      "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2025/10/wifi-router-wireless-signal.jpg",
      "content": "We spend so much time online that how we connect to the internet has become almost as important as the devices we use. Most people never give it a second thought. They connect their computer to Wi-Fi… [+7725 chars]"
    },
    {
      "title": "Stricter visa rules have Colorado employers that rely on foreign workers scrambling",
      "description": "The addition of a $100,000 application fee for new H-1B petitions could have significant implications for tech employers in states like Colorado, where younger and smaller firms dominate.",
      "source": "The Denver Post",
      "url": "https://www.denverpost.com/2025/10/12/h1b-visas-trump-immigration-colorado-employers/",
      "published_at": "2025-10-12T12:00:38Z",
      "author": "Aldo Svaldi",
      "image_url": "https://www.denverpost.com/wp-content/uploads/2025/10/TDP-L-FAGERBERG-PRODUCE_JAC5844.jpg?w=1024&h=797",
      "content": "Iterate.ai has relied heavily on highly trained tech workers from around the globe to meet demand for its customized artificial intelligence agent systems, bringing some of them to the U.S. under the… [+18269 chars]"
    },
    {
      "title": "Humanoid Robots Headed to War? I Went Hands-On With the Phantom MK1",
      "description": "At Foundation's headquarters in San Francisco, I met the Phantom MK1 humanoid robot and controlled it using a VR headset. The CEO told me his aspirations to deploy the robot in factories, on battlefields and, someday, on Mars.",
      "source": "CNET",
      "url": "https://www.cnet.com/tech/computing/humanoid-robots-headed-to-war-hands-on-with-phantom-mk1/",
      "published_at": "2025-10-12T12:00:03Z",
      "author": "Jesse Orrall",
      "image_url": "https://www.cnet.com/a/img/resize/bf5fe1f28ee77d60a1a9061daaa235fd63d89452/hub/2025/10/10/d17c4522-563a-4ab4-b1db-2c5d9510255e/p1017015.jpg?auto=webp&fit=crop&height=675&width=1200",
      "content": "In the increasingly crowded field of humanoid robotics, one thing that makes Foundation and its Phantom robot stand out is the company's embrace of the defense industry. That includes perhaps someday… [+608 chars]"
    },
    {
      "title": "Corsair Vanguard Pro 96 review: A 96-percent magnetic switch keyboard with a semi-customizable LCD screen",
      "description": "The Corsair Vanguard Pro 96 is a fun and impressive 96-percent mechanical keyboard. While at the time of review I was disappointed by the LCD screen’s lack of features at the time of review.",
      "source": "Tom's Hardware UK",
      "url": "https://www.tomshardware.com/peripherals/gaming-keyboards/corsairvanguard-pro-96-review",
      "published_at": "2025-10-12T12:00:00Z",
      "author": "mylesgoldman@icloud.com (Myles Goldman) , Myles Goldman",
      "image_url": "https://cdn.mos.cms.futurecdn.net/kRKNwy44gBWECWRSs2hCpF-2560-80.jpg",
      "content": "Why you can trust Tom's Hardware\r\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.Mechanical keyboards… [+9058 chars]"
    },
    {
      "title": "AI, Cognitive Obesity and Arrested Development",
      "description": "GUEST POST from Pete Foley Some of the biggest questions of our age are whether AI will ultimately benefit or hurt us, and how big its’ effect will ultimately be. And that of course is a problem with any big, disruptive technology.  We want to anticipate how …",
      "source": "Bradenkelley.com",
      "url": "https://bradenkelley.com/2025/10/ai-cognitive-obesity-and-arrested-development/",
      "published_at": "2025-10-12T12:00:00Z",
      "author": "Pete Foley",
      "image_url": null,
      "content": "GUEST POST from Pete Foley\r\nSome of the biggest questions of our age are whether AI will ultimately benefit or hurt us, and how big its’ effect will ultimately be.\r\nAnd that of course is a problem wi… [+18846 chars]"
    },
    {
      "title": "What I Learned Testing the Starlink Mini Deep in the Washington Wilderness",
      "description": "From my home office to the North Cascades wilderness, I tested out the Starlink Mini Dish for a week to see what it’s made of.",
      "source": "CNET",
      "url": "https://www.cnet.com/home/internet/what-i-learned-testing-the-starlink-mini-deep-in-the-washington-wilderness/",
      "published_at": "2025-10-12T12:00:00Z",
      "author": "Joe Supan",
      "image_url": "https://www.cnet.com/a/img/resize/2570446ad5409ab37d280e1da1afccc7fc106ca1/hub/2025/10/10/262075af-404b-4d72-90d3-db54fc7bb117/img-6602.jpg?auto=webp&fit=crop&height=675&width=1200",
      "content": "On almost every hike or camping trip I take in Washington state, there's a moment on the drive when service drops, music cuts out in the car and texts stop coming in. That's when I start hoping I rem… [+14240 chars]"
    },
    {
      "title": "Dubai Trackless Tram: The Future of Transport Is on the Move",
      "description": "Dubai has never waited for the future—it builds it. From the world’s first driverless metro in the region to flying taxi trials, the city is once again redefining mobility with a bold new project: the Dubai Trackless Tram. Elegant, efficient, and engineered f…",
      "source": "Dubaichronicle.com",
      "url": "https://www.dubaichronicle.com/2025/10/12/dubai-trackless-tram-the-future-of-transport-is-on-the-move/",
      "published_at": "2025-10-12T11:52:06Z",
      "author": "Dubai Chronicle",
      "image_url": "https://i0.wp.com/www.dubaichronicle.com/wp-content/uploads/2025/10/dubai_trackless_tram.jpg?fit=1024%2C1024&ssl=1",
      "content": "Dubai has never waited for the futureit builds it. From the worlds first driverless metro in the region to flying taxi trials, the city is once again redefining mobility with a bold new project: the … [+4540 chars]"
    },
    {
      "title": "Australian construction robot Charlotte can 3D print 2,150-sq-ft home in one day using sustainable materials",
      "description": "Australian construction robot Charlotte uses sand, crushed brick and recycled glass to 3D print fireproof, floodproof homes with reduced carbon footprint.",
      "source": "Fox News",
      "url": "https://www.foxnews.com/tech/australian-construction-robot-charlotte-can-3d-print-2150-sq-ft-home-one-day-using-sustainable-materials",
      "published_at": "2025-10-12T11:51:46Z",
      "author": null,
      "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2025/10/robot-3d-printing-home-desert.jpg",
      "content": "Construction robots are no longer a far-off idea. They're already changing job sites by tackling repetitive, heavy, and often dangerous tasks. The latest robot comes from Australia, where a spider-li… [+4173 chars]"
    },
    {
      "title": "Federal Judge Grants Unprecedented Anonymity In Voter Data Privacy Suit Against DHS, SSA",
      "description": "In a highly unusual move, a federal judge has granted five individual plaintiffs the right to proceed anonymously—even from the government defendants—in a",
      "source": "Tampafp.com",
      "url": "https://www.tampafp.com/federal-judge-grants-unprecedented-anonymity-in-voter-data-privacy-suit-against-dhs-ssa/",
      "published_at": "2025-10-12T11:50:27Z",
      "author": "Danielle Shockey",
      "image_url": "https://www.tampafp.com/wp-content/uploads/2022/05/Judge-Court-Law-Justice.jpeg",
      "content": "In a highly unusual move, a federal judge has granted five individual plaintiffs the right to proceed anonymouslyeven from the government defendantsin a class-action lawsuit challenging the Departmen… [+3450 chars]"
    },
    {
      "title": "India emerges as IMDb’s second-largest market, after US—powered by multilingual storytelling",
      "description": "IMDb’s India audience has doubled in five years, with over 414,000 titles listed across 15+ languages, making the country its second-largest market after the US.",
      "source": "Livemint",
      "url": "https://www.livemint.com/industry/media/india-emerges-as-imdb-s-second-largest-market-after-us-powered-by-multilingual-storytelling-11760252276996.html",
      "published_at": "2025-10-12T11:49:17Z",
      "author": "Lata Jha",
      "image_url": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/Yaminie_Patodia_1760252361529_1760252377157_1760269842216.jpg",
      "content": "India, known for its rich entertainment ecosystem and linguistic diversity, is now the second-largest audience for IMDb, the Internet movie database owned by Amazon, after the United States. Over the… [+3707 chars]"
    },
    {
      "title": "Xiaomi to launch a new Poco tablet globally according to certifications",
      "description": "Xiaomi apparently has a new tablet in the pipeline. Development of the device appears to already be in the finishing stages, so a release is likely soon. The model is expected to feature cellular connectivity.",
      "source": "Notebookcheck.net",
      "url": "https://www.notebookcheck.net/Xiaomi-to-launch-a-new-Poco-tablet-globally-according-to-certifications.1136638.0.html",
      "published_at": "2025-10-12T11:49:00Z",
      "author": "Silvio Werner",
      "image_url": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/csm_pocopad_3f437b5104.jpg",
      "content": "Relatively reliable leaks come not only from insider information, but also from databases maintained by government agencies, such as those responsible for issuing declarations of device compliance. O… [+1257 chars]"
    },
    {
      "title": "ICAI mulling ways to help desi firms to gain financial strength to compete with big four audit, accounting & advisory firms",
      "description": "“Indian firms getting ready to compete with big global firms will need to open more branches, employ more people; All these will require financial resource--ICAI is preparing a report to help in this direction”",
      "source": "BusinessLine",
      "url": "https://www.thehindubusinessline.com/economy/icai-mulling-ways-to-help-desi-firms-to-gain-financial-strength-to-compete-with-big-four-audit-accounting-advisory-firms/article70154589.ece",
      "published_at": "2025-10-12T11:36:13Z",
      "author": "Shishir Sinha",
      "image_url": "https://bl-i.thgim.com/public/incoming/h76pce/article70154904.ece/alternates/LANDSCAPE_1200/IMG_BL25_Think_spreadshe_2_1_AQE9RGKH.jpg",
      "content": ",\r\nIn order to facilitate the governments vision for developing big desi firms to compete with the big four audit, accounting and advisory firms, the Institute of Chartered Accounts of India (ICAI) o… [+3584 chars]"
    },
    {
      "title": "Optimizing For AI-Generated Search Results: A Universal Guide | The Marketing Tutor",
      "description": "Enhancing Your Knowledge of AI-Driven Search Algorithms How Do AI Algorithms Effectively Process User Queries? AI-generated search algorithms employ a variety of sophisticated techniques to efficiently process user queries. Gaining a deeper understanding of t…",
      "source": "Marketing-tutor.com",
      "url": "https://marketing-tutor.com/blog/optimizing-for-ai-generated-search-results-a-universal-guide/",
      "published_at": "2025-10-12T11:34:32Z",
      "author": "Geoff Lord",
      "image_url": "https://marketing-tutor.com/blog/wp-content/uploads/2021/07/MT-Logo-260-x260.png",
      "content": "Enhancing Your Knowledge of AI-Driven Search Algorithms\r\nHow Do AI Algorithms Effectively Process User Queries?\r\nAI-generated search algorithms employ a variety of sophisticated techniques to efficie… [+33862 chars]"
    },
    {
      "title": "CARB Publishes Preliminary List of Companies Potentially Subject to SB 253 and SB 261",
      "description": "The California Air Resources Board (CARB) took a significant step forward recently in implementing the state’s climate disclosure laws: SB 253 (the Climate Corporate Data Accountability Act) and SB 261 (the Climate-Related Financial Risk Disclosure law), in e…",
      "source": "Harvard School of Engineering and Applied Sciences",
      "url": "https://corpgov.law.harvard.edu/2025/10/12/carb-publishes-preliminary-list-of-companies-potentially-subject-to-sb-253-and-sb-261/",
      "published_at": "2025-10-12T11:30:59Z",
      "author": "Andrew Oelz, Kenneth Markowitz, Stacey Mitchell, Andrew Oelz, Kenneth Markowitz, Stacey Mitchell",
      "image_url": "https://corpgov.law.harvard.edu/wp-content/uploads/2021/03/new-shield-facebook.png",
      "content": "The California Air Resources Board (CARB) took a significant step forward recently in implementing the states climate disclosure laws: SB 253 (the Climate Corporate Data Accountability Act) and SB 26… [+5310 chars]"
    },
    {
      "title": "China says Qualcomm admits failing to report Autotalks acquisition, antitrust probe threat looms over chipmaker",
      "description": "China stated that Qualcomm failed to report the Autotalks acquisition to the State Administration for Market Regulation (SAMR), prompting the authorities to initiate an antitrust investigation against Qualcomm on Friday.",
      "source": "Livemint",
      "url": "https://www.livemint.com/companies/news/china-says-qualcomm-admits-failing-to-report-autotalks-acquisition-antitrust-probe-threat-looms-over-chipmaker-11760264149797.html",
      "published_at": "2025-10-12T11:30:36Z",
      "author": "Anubhav Mukherjee",
      "image_url": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/QUALCOMM-BRITAIN-COURT-0_1760111700511_1760111710910_1760267595560.JPG",
      "content": "China's State Administration for Market Regulation (SAMR) announced on Sunday, 12 October 2025, that the US-based chipmaking giant Qualcomm had admitted to not informing the Chinese authorities when … [+2292 chars]"
    },
    {
      "title": "New HydroHaptic technology could have you squeezing, pinching, and twisting a pliable mouse or joystick",
      "description": "Computer scientists have revealed an innovative, expressive, two-way input peripheral technology dubbed HydroHaptics.",
      "source": "Tom's Hardware UK",
      "url": "https://www.tomshardware.com/peripherals/controllers-gamepads/new-hydrohaptic-technology-could-have-you-squeezing-pinching-and-twisting-a-pliable-mouse-or-joystick",
      "published_at": "2025-10-12T11:20:00Z",
      "author": "Mark Tyson",
      "image_url": "https://cdn.mos.cms.futurecdn.net/cvixvtRcRJ3QX2hmuADrdB-1920-80.jpg",
      "content": "Computer scientists led by a team from the University of Bath have revealed an innovation they dub HydroHaptics. They say the new technology enables “expressive, two-way communication,” between the u… [+3447 chars]"
    },
    {
      "title": "EY, Microsoft launch AI Skills Passport to prepare India's youth for AI-driven future",
      "description": "The AI Skills Passport is part of a global effort that has already seen over 40,000 participants and 13,000 completions worldwide",
      "source": "BusinessLine",
      "url": "https://www.thehindubusinessline.com/info-tech/ey-microsoft-launch-ai-skills-passport-to-prepare-indias-youth-for-ai-driven-future/article70154856.ece",
      "published_at": "2025-10-12T11:16:56Z",
      "author": "ANI",
      "image_url": "https://bl-i.thgim.com/public/incoming/h3e84k/article70154873.ece/alternates/LANDSCAPE_1200/image%208.jpg",
      "content": "EY and Microsoft have launched the AI Skills Passport, a free online learning program designed to build essential artificial intelligence (AI) capabilities among students and early-career professiona… [+2745 chars]"
    },
    {
      "title": "Fusion device fires “super-lightning” pulses 12 times a minute",
      "description": "Living up to its name, University of Washington spin-off company ZAP Energy's Century system is developing fusion power technology by blasting plasma with super-lightning-like pulses 12 times per minute, without relying on superconducting magnets or laser bea…",
      "source": "New Atlas",
      "url": "https://newatlas.com/energy/z-pinch-fusion-device-lighting-bolts/",
      "published_at": "2025-10-12T11:03:00Z",
      "author": "David Szondy",
      "image_url": "https://assets.newatlas.com/dims4/default/2065789/2147483647/strip/true/crop/1800x945+0+128/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2F9f%2F82%2F5cab52c541169d72940462e10df7%2F68d5768eb2b150ada8a851b1-century-39kw-lead.jpg&na.image_optimisation=0",
      "content": "Living up to its name, University of Washington spin-off company ZAP Energy's Century system is developing fusion power technology by blasting plasma with super-lightning-like pulses 12 times per min… [+2965 chars]"
    },
    {
      "title": "This Week In Small Business Technology News: Apps Can Be Used Inside Of ChatGPT And A Big New Microsoft Teams Feature",
      "description": "ChatGPT now has apps inside, Microsoft Teams gets a productivity boost, Perplexity says its Comet AI browser boost productivity and Talkdesk has a customer service survey.",
      "source": "Forbes",
      "url": "https://www.forbes.com/sites/quickerbettertech/2025/10/12/this-week-in-small-business-technology-news-apps-can-be-used-inside-of-chatgpt-and-a-big-new-microsoft-teams-feature/",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Gene Marks, Contributor, \n Gene Marks, Contributor\n https://www.forbes.com/sites/quickerbettertech/",
      "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e981043f75ec435f38c911/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
      "content": "SAN FRANCISCO, CALIFORNIA - NOVEMBER 06: OpenAI CEO Sam Altman speaks during the OpenAI DevDay event on November 06, 2023 in San Francisco, California. Altman delivered the keynote address at the fir… [+5483 chars]"
    },
    {
      "title": "‘Youngism’ is the biggest threat Gen Z workers face right now, says leadership expert — and its effects are ‘startling’",
      "description": "Younger workers are questioned, dismissed and stereotyped — here’s how they can fight back.",
      "source": "Yahoo Entertainment",
      "url": "https://finance.yahoo.com/news/youngism-biggest-threat-gen-z-110000347.html",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Vawn Himmelsbach",
      "image_url": "https://media.zenfs.com/en/moneywise_327/51218ee10537f4258f1d215f724403fb",
      "content": "While Gen Z workers might be worried about how AI will impact the job market, its not the only threat to building a career.\r\nWhile older workers may face discrimination in the workplace being passed … [+6247 chars]"
    },
    {
      "title": "Physicists capture rare illusion of an object moving at 99.9% the speed of light",
      "description": "For the first time, physicists have simulated what objects moving near the speed of light would look like — an optical illusion called the Terrell-Penrose effect.",
      "source": "Live Science",
      "url": "https://www.livescience.com/physics-mathematics/physicists-capture-rare-illusion-of-an-object-moving-at-99-9-percent-the-speed-of-light",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Larissa G. Capella",
      "image_url": "https://cdn.mos.cms.futurecdn.net/k24Ej2rVn54LYAFtJBumEi-1920-80.jpg",
      "content": "Using ultra-fast laser pulses and special cameras, scientists have simulated an optical illusion that appears to defy Einstein's theory of special relativity\r\n.\r\nOne consequence of special relativity… [+4089 chars]"
    },
    {
      "title": "Eni Progresses Permit Process for Its 2nd Biorefinery in Sicily",
      "description": "Designed to produce up to 500,000 MMtpa of HVO diesel and SAF, the Priolo project will rise on the site of an Eni ethylene plant set to be decommissioned.",
      "source": "Rigzone",
      "url": "https://www.rigzone.com/news/eni_progresses_permit_process_for_its_2nd_biorefinery_in_sicily-12-oct-2025-182049-article/",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Jov Onsat",
      "image_url": "https://images.rigzone.com/images/news/articles/Eni-Progresses-Permit-Process-for-Its-2nd-Biorefinery-in-Sicily-182049-1200x628.png",
      "content": "Eni SpA said Thursday it had launched the authorization process for an Environmental Impact Assessment to build a biorefinery and a chemical recycling plant in Sicily, after receiving approval from I… [+3730 chars]"
    },
    {
      "title": "New Age of Empires Games Are Seemingly Powered by Unreal Engine 5",
      "description": "According to a job listing posted this week, a new Age of Empires game is in development at World's Edge. This, by itself, is no big surprise, since Microsoft's historic real-time strategy franchise has enjoyed a quiet renaissance in the last few years. Betwe…",
      "source": "Wccftech",
      "url": "https://wccftech.com/new-age-of-empires-games-seemingly-powered-by-unreal-engine-5/",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Alessio Palumbo",
      "image_url": "https://cdn.wccftech.com/wp-content/uploads/2025/10/Age_of_Empires_Series-HD-scaled.jpeg",
      "content": "According to a job listing posted this week, a new Age of Empires game is in development at World's Edge. This, by itself, is no big surprise, since Microsoft's historic real-time strategy franchise … [+2239 chars]"
    },
    {
      "title": "TouringPlans Travel Beat 10-12-2025",
      "description": "At Travel Beat we have all the “other” news from the last week or so—the stuff that wasn’t big enough to stop the presse",
      "source": "Touringplans.com",
      "url": "https://touringplans.com/blog/touringplans-travel-beat-10-12-2025/",
      "published_at": "2025-10-12T11:00:00Z",
      "author": "Jennifer Heymont",
      "image_url": "https://blog-cdn.touringplans.com/blog/wp-content/uploads/2025/10/Chelsea-Row-Houses-Travel-Beat-cover.jpg",
      "content": "At Travel Beat we have all the other news from the last week or sothe stuff that wasnt big enough to stop the presses for. What did the newsroom bring us this week? (Sneak peek: It was a banger!) Bul… [+14340 chars]"
    },
    {
      "title": "China's upcoming strategic rail link near LAC has security concerns, warn Tibetan experts",
      "description": "China's new railway line in Tibet raises concerns over military implications for India, boosting Chinese influence in the region.",
      "source": "BusinessLine",
      "url": "https://www.thehindubusinessline.com/economy/logistics/chinas-upcoming-strategic-rail-link-near-lac-has-security-concerns-warn-tibetan-experts/article70154774.ece",
      "published_at": "2025-10-12T10:56:29Z",
      "author": "ANI",
      "image_url": "https://bl-i.thgim.com/public/incoming/mp5431/article70154819.ece/alternates/LANDSCAPE_1200/2025-01-20T110310Z_1586405703_RC2MDCASMB1H_RTRMADP_3_INDIA-TRANSPORT-BUDGET.JPG",
      "content": "China has begun work on a new strategic railway line connecting Tibet to the Chinese city of Lhasa, a route that runs close to the Line of Actual Control (LAC), sparking fresh concerns over its poten… [+3428 chars]"
    },
    {
      "title": "Graphic Design Trends 2026: Ten Bold Directions Shaping Creativity",
      "description": "As 2026 draws near, the conversation around graphic design trends extends well beyond what was defined in 2025. Rapid developments in generative technology, growing demands for sustainability, and...",
      "source": "Weandthecolor.com",
      "url": "https://tumblr.weandthecolor.com/post/797196982740484096/graphic-design-trends-2026-ten-bold-directions",
      "published_at": "2025-10-12T10:51:27Z",
      "author": null,
      "image_url": "https://64.media.tumblr.com/1350596069fc2b5772799d058f2c7bbe/dd5b7e0e0378ce1d-db/s1280x1920/5f18df572142f62506ba560da4bf3608093e2645.webp",
      "content": "As 2026 draws near, the conversation around graphic design trends extends well beyond what was defined in 2025. Rapid developments in generative technology, growing demands for sustainability, and ev… [+673 chars]"
    },
    {
      "title": "MAW Vriddhi EV Exchange Carnival",
      "description": "MAW Vriddhi Launches Mega Exchange Carnival for Electric Vehicles in Kathmandu Looking to upgrade your ride to a stylish and technologically advanced EV this festive season? MAW Vriddhi, a leading automobile group in Nepal, has launched a mega exchange carniv…",
      "source": "Nep123.com",
      "url": "https://nep123.com/maw-vriddhi-ev-exchange-carnival/",
      "published_at": "2025-10-12T10:50:10Z",
      "author": "Editor",
      "image_url": "https://nep123.com/wp-content/uploads/2025/09/basantapur_featured.jpg",
      "content": "MAW Vriddhi Launches Mega Exchange Carnival for Electric Vehicles in Kathmandu\r\nLooking to upgrade your ride to a stylish and technologically advanced EV this festive season? MAW Vriddhi, a leading a… [+1745 chars]"
    },
    {
      "title": "Graphic Design Trends 2026: Ten Bold Directions Shaping Creativity",
      "description": "As 2026 approaches, the conversation around graphic design trends goes far beyond 2025. Rapid advances in generative technology, rising expectations around sustainability, and fresh perspectives on inclusivity are reshaping visual culture. Designers can’t sim…",
      "source": "Weandthecolor.com",
      "url": "https://weandthecolor.com/graphic-design-trends-2026-ten-bold-directions-shaping-creativity/206176",
      "published_at": "2025-10-12T10:42:44Z",
      "author": "Dirk Petzold",
      "image_url": "https://weandthecolor-21f52.kxcdn.com/wp-content/uploads/2025/10/Top-10-Graphic-Design-Trends-2026.webp",
      "content": "As 2026 approaches, the conversation around graphic design trends goes far beyond 2025. Rapid advances in generative technology, rising expectations around sustainability, and fresh perspectives on i… [+15810 chars]"
    },
    {
      "title": "Why The Grumpy Designer Is Wary of AI’s Confidence",
      "description": "AI speaks with confidence, but that doesn’t mean it’s right. The Grumpy Designer explores why self-assured answers can mislead users and what AI tools should do instead.\nThe post Why The Grumpy Designer Is Wary of AI’s Confidence appeared first on Speckyboy D…",
      "source": "Speckyboy.com",
      "url": "https://speckyboy.com/grumpy-designer-iwary-of-ais-confidence/",
      "published_at": "2025-10-12T10:37:17Z",
      "author": "Eric Karkovack",
      "image_url": "https://speckyboy.com/wp-content/uploads/2025/09/ai-confidence-thumb.webp",
      "content": "Confidence is a funny thing. I struggled with it as a child. I didnt believe I was good enough to excel in school or athletics. Even so, I was a terrific partner in pop-culture trivia.\r\nGrowing up to… [+6365 chars]"
    },
    {
      "title": "China's upcoming strategic rail link from Tibet to Lhasa near LAC, big security concern for India, warn Tibetan experts",
      "description": "China is constructing a new strategic railway line connecting Tibet to Lhasa, running close to the Line of Actual Control (LAC). This project, expected within five years, aims to boost military logistics and resource exploitation, raising security concerns fo…",
      "source": "The Times of India",
      "url": "https://economictimes.indiatimes.com/news/defence/chinas-upcoming-strategic-rail-link-from-tibet-to-lhasa-near-lac-big-security-concern-for-india-warn-tibetan-experts/articleshow/124499596.cms",
      "published_at": "2025-10-12T10:35:22Z",
      "author": "ANI",
      "image_url": "https://img.etimg.com/thumb/msid-124499619,width-1200,height-630,imgsize-48748,overlay-etdefence/articleshow.jpg",
      "content": "Dharamshala: China has begun work on a new strategic railway line connecting Tibet to the Chinese city of Lhasa, a route that runs close to the Line of Actual Control (LAC), sparking fresh concerns o… [+3457 chars]"
    },
    {
      "title": "7 features you should expect from 2026 flagship Android phones",
      "description": "From super-dim displays to higher-quality 200MP photos, here's what to expect from 2026's flagship Android phones.",
      "source": "Android Authority",
      "url": "https://www.androidauthority.com/2026-flagship-android-phones-features-expect-3605296/",
      "published_at": "2025-10-12T10:30:05Z",
      "author": "Hadlee Simons",
      "image_url": "https://www.androidauthority.com/wp-content/uploads/2025/06/OnePlus-13-vs-Galaxy-S25-Ultra-vs-Pixel-9-Pro-XL-front-on.jpg",
      "content": "This was a significant year for Android phones, as several innovations and improvements were keenly felt. Whether its the Snapdragon 8 Elites huge CPU performance leap, the continued rise of silicon-… [+7787 chars]"
    },
    {
      "title": "10 Sunday Reads",
      "description": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures: • Who maintains the scaffolding of freedom? The prosperity the western world enjoyed for decades was the result of ideas, specifically classical liberal ideas about free …",
      "source": "Ritholtz.com",
      "url": "https://ritholtz.com/2025/10/10-sunday-reads-203/",
      "published_at": "2025-10-12T10:30:03Z",
      "author": "Barry Ritholtz",
      "image_url": "https://ritholtz.com/wp-content/uploads/2026/12/apps.png",
      "content": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures:Who maintains the scaffolding of freedom? The prosperity the western world enjoyed for decades was the result o… [+4527 chars]"
    },
    {
      "title": "Are deepfakes of dead people rewriting the past?",
      "description": "While Sora has some guardrails around the likenesses of living people, protections around the likenesses of those who have died appear to be an afterthought.",
      "source": "NBC News",
      "url": "https://www.nbcnews.com/tech/tech-news/are-deepfakes-dead-people-rewriting-rcna235982",
      "published_at": "2025-10-12T10:30:00Z",
      "author": "Jared Perlo",
      "image_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-10/251006-Sora-2-openai-aa-237-1e9e42.jpg",
      "content": "OpenAIs new text-to-video app, Sora, was supposed to be a social AI playground, allowing users to create imaginative AI videos of themselves, friends and celebrities while building off of others idea… [+8805 chars]"
    },
    {
      "title": "It’s time for economists and policymakers to take a wider view of our national assets and growth drivers",
      "description": "China’s economy has outperformed India’s and our post-1991 policy approach cannot escape its share of blame. Our industrial gap with China demands that we nudge our policymakers to broaden their perspective of what matters. National assets, for example, if ac…",
      "source": "Livemint",
      "url": "https://www.livemint.com/opinion/online-views/india-china-trade-imbalance-indian-manufacturing-industrial-policy-debate-capital-goods-sector-production-gdp-jobs-fuel-11759996225549.html",
      "published_at": "2025-10-12T10:17:07Z",
      "author": "Arun Maira",
      "image_url": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/india_china_1760264133266_1760264133482.jpeg",
      "content": "India has become strategically vulnerable, caught between the US and China. Chinas capital goods production sector has grown 50 times larger than Indias since the liberalization of our economy, when … [+5921 chars]"
    },
    {
      "title": "Does Serve Robotics' DoorDash Partnership Challenge Uber’s Delivery Ambitions and Ecosystem Advantage (UBER)?",
      "description": "Serve Robotics announced the launch of its sidewalk robot delivery service across 14 Chicago neighborhoods in collaboration with Uber Eats, building on...",
      "source": "Yahoo Entertainment",
      "url": "https://finance.yahoo.com/news/does-serve-robotics-doordash-partnership-101020040.html",
      "published_at": "2025-10-12T10:10:20Z",
      "author": "Simply Wall St",
      "image_url": "https://media.zenfs.com/en/simply_wall_st__316/cfa0f05cef7298ff8df3db38405f2803",
      "content": "<ul><li>Serve Robotics announced the launch of its sidewalk robot delivery service across 14 Chicago neighborhoods in collaboration with Uber Eats, building on previous rollouts in Los Angeles, Miami… [+3752 chars]"
    },
    {
      "title": "Fusion power is now a matter of ’when’ not ’if’",
      "description": "Investing.com -- After gaining insights from a fireside chat with Bob Mumgaard, chief executive of Commonwealth Fusion Systems (CFS), Kepler Cheuvreux said...",
      "source": "Yahoo Entertainment",
      "url": "https://finance.yahoo.com/news/fusion-power-now-matter-not-100505447.html",
      "published_at": "2025-10-12T10:05:05Z",
      "author": "Sam Boughedda",
      "image_url": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
      "content": "Investing.com -- After gaining insights from a fireside chat with Bob Mumgaard, chief executive of Commonwealth Fusion Systems (CFS), Kepler Cheuvreux said in a note this week that fusion power is no… [+1625 chars]"
    },
    {
      "title": "Malaysia to take part in UNTCC chiefs' conclave in New Delhi",
      "description": "KUALA LUMPUR: Malaysia has confirmed its participation in the United Nations Troop Contributing Countries' (UNTCC) Chiefs' Conclave in New Delhi, which will bring together senior military leaders from 32 nations to discuss measures to strengthen United Nation…",
      "source": "The Star Online",
      "url": "https://www.thestar.com.my/news/nation/2025/10/12/malaysia-to-take-part-in-untcc-chiefs039-conclave-in-new-delhi",
      "published_at": "2025-10-12T10:04:00Z",
      "author": "The Star Online",
      "image_url": "https://apicms.thestar.com.my/uploads/images/2025/10/12/3566783.jpg",
      "content": "KUALA LUMPUR: Malaysia has confirmed its participation in the United Nations Troop Contributing Countries' (UNTCC) Chiefs' Conclave in New Delhi, which will bring together senior military leaders fro… [+3110 chars]"
    },
    {
      "title": "Numerous Billionaires Preparing for End of Society",
      "description": "Guns, gold, and bunkers galore.\nThe post Numerous Billionaires Preparing for End of Society appeared first on Futurism.",
      "source": "Futurism",
      "url": "https://futurism.com/artificial-intelligence/billionaires-preparing-for-end",
      "published_at": "2025-10-12T10:00:00Z",
      "author": "Maggie Harrison Dupré",
      "image_url": "https://futurism.com/wp-content/uploads/2025/10/billionaires-preparing-for-end.jpg?quality=85&w=1200",
      "content": "The tech billionaires are still doomsday prepping. And as the BBC reports, it seems that AI is making some of them more paranoid than ever that society as we know it might soon crumble.\r\nFor years no… [+4568 chars]"
    },
    {
      "title": "Apple’s entire M5 Mac lineup reportedly leaks: full timeline, models, and specifications",
      "description": "Apple’s full M5 Mac roadmap has reportedly leaked, revealing upcoming MacBook and desktop models ranging from the M5 Pro and Air to the iMac and Mac Studio. The report outlines the expected launch timeline, key specifications, and what to expect from each dev…",
      "source": "Notebookcheck.net",
      "url": "https://www.notebookcheck.net/Apple-s-entire-M5-Mac-lineup-reportedly-leaks-full-timeline-models-and-specifications.1136516.0.html",
      "published_at": "2025-10-12T09:56:00Z",
      "author": "Anmol Dubey",
      "image_url": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/apple-mac-lineup-collage-macbook-pro-air-mac-mini-notebookcheck.jpg",
      "content": "The key difference is the new M5 chip, which, based on early iPad Pro benchmark results, appears to deliver significantly higher GPU performance compared to the M4. No major design changes are expect… [+2192 chars]"
    }
  ],
  "raw_response": {
    "status": "ok",
    "totalResults": 47370,
    "articles": [
      {
        "source": {
          "id": null,
          "name": "Yahoo Entertainment"
        },
        "author": "David Kirakosyan",
        "title": "Here's How You Can Earn $100 In Passive Income By Investing In Becton Dickinson Stock",
        "description": "Becton, Dickinson and Co. (NYSE:BDX) is a multinational medical technology company that manufactures and sells medical devices, instruments, and reagents for...",
        "url": "https://finance.yahoo.com/news/heres-earn-100-passive-income-122302865.html",
        "urlToImage": "https://media.zenfs.com/en/benzinga_79/243991432441d3dea814a492ed56a9f1",
        "publishedAt": "2025-10-12T12:23:02Z",
        "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\r\nBecton, Dickinson and Co. (NYSE:BDX) is a multinational medical technology company that manufactu… [+3754 chars]"
      },
      {
        "source": {
          "id": "financial-post",
          "name": "Financial Post"
        },
        "author": "Bloomberg News",
        "title": "As AI-Bubble Fears Spread, a $35 Billion Fund Manager Positions for Inflows",
        "description": "Impax Asset Management Group is positioned to benefit should concerns about an AI-driven bubble trigger a sudden shift away from Big Tech, its chief executive said.",
        "url": "https://financialpost.com/pmn/business-pmn/as-ai-bubble-fears-spread-a-35-billion-fund-manager-positions-for-inflows",
        "urlToImage": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/10/is-it-a-bubble-.jpg",
        "publishedAt": "2025-10-12T12:22:06Z",
        "content": "(Bloomberg) Impax Asset Management Group is positioned to benefit should concerns about an AI-driven bubble trigger a sudden shift away from Big Tech, its chief executive said.\r\nTHIS CONTENT IS RESER… [+4875 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Kotaku"
        },
        "author": "Kotaku Deals",
        "title": "Got a PS5, Xbox, or Switch? This Portable Monitor Going for Pennies Lets You Play Anywhere",
        "description": "Perfect for console gaming on the go, and just as handy as a second screen for your work laptop.\nThe post Got a PS5, Xbox, or Switch? This Portable Monitor Going for Pennies Lets You Play Anywhere appeared first on Kotaku.",
        "url": "https://kotaku.com/got-a-ps5-xbox-or-switch-this-portable-monitor-going-for-pennies-lets-you-play-anywhere-2000634469",
        "urlToImage": "https://kotaku.com/app/uploads/2025/08/mnn-portable-monitor-fhd-1200x675.jpg",
        "publishedAt": "2025-10-12T12:21:00Z",
        "content": "Gaming on your Switch’s built-in screen is fine for short bursts, but after an hour of Mario Kart or Zelda, your eyes start begging for mercy. And if you’re living in a dorm room or apartment without… [+3036 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Kotaku"
        },
        "author": "Kotaku Deals",
        "title": "Apple Is Going Nuts, The MacBook Air 2025 Is Now Cheaper Than a Random Mid-Range Windows Laptop",
        "description": "An official (and new) MacBook Air has never been this cheap.\nThe post Apple Is Going Nuts, The MacBook Air 2025 Is Now Cheaper Than a Random Mid-Range Windows Laptop appeared first on Kotaku.",
        "url": "https://kotaku.com/apple-is-going-nuts-the-macbook-air-2025-is-now-cheaper-than-a-random-mid-range-windows-laptop-2000634464",
        "urlToImage": "https://kotaku.com/app/uploads/2025/09/Apple-2025-MacBook-Air-13-inch-Laptop-with-M4-chip-1200x675.jpg",
        "publishedAt": "2025-10-12T12:11:26Z",
        "content": "You know that feeling when you walk past an Apple Store and imagine what it would be like to own one of those sleek MacBooks but then you remember your budget and keep walking? That mental barrier ju… [+2283 chars]"
      },
      {
        "source": {
          "id": "fortune",
          "name": "Fortune"
        },
        "author": "Stephan Meier, Joel Brockner",
        "title": "The new corner office is at home",
        "description": "We're Columbia Business School professors and we know there’s no shortage of felt unfairness in the workplace, especially when it comes to remote work.",
        "url": "https://fortune.com/2025/10/12/the-new-corner-office-is-at-home-remote-work-status-inequality/",
        "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/10/GettyImages-2171207102-e1759894729713.jpg?resize=1200,600",
        "publishedAt": "2025-10-12T12:05:00Z",
        "content": "For decades, a seemingly trivial issue who gets the best parking spot and office has ignited officewide tension. Employees grumble over who gets to park where and how offices were allocated (or who g… [+5101 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "LADbible"
        },
        "author": "James Moorhouse",
        "title": "The 40 jobs ‘most at risk of being replaced by AI’",
        "description": "The 40 jobs most at risk of being replaced by artificial intelligence have been revealed.",
        "url": "https://www.ladbible.com/news/technology/ai-jobs-at-risk-technology-microsoft-405782-20251012",
        "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blteda1e30bad079cab/68eb8b9c878ecf726c2b0631/artificial-intelligence-jobs-risk.jpg",
        "publishedAt": "2025-10-12T12:02:21Z",
        "content": "The 40 jobs most at risk of being replaced by artificial intelligence have been revealed by Microsoft.\r\nAI has proven itself to have many uses in everyday life but it's getting smarter by the day, wi… [+2561 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Geeky Gadgets"
        },
        "author": "Julian Horsey",
        "title": "ChatGPT 5 Can Now Connect Every Tool You Use",
        "description": "Have you ever wished your tools could talk to each other, seamlessly sharing data, automating repetitive tasks, and freeing you to focus on the work that truly matters? Imagine updating a CAD design based on data from SAP without lifting a finger or juggling …",
        "url": "https://www.geeky-gadgets.com/chatgpt-apps-and-tool-integration/",
        "urlToImage": "https://www.geeky-gadgets.com/wp-content/uploads/2025/10/chatgpt-integrating-tools_optimized.jpg",
        "publishedAt": "2025-10-12T12:01:25Z",
        "content": "Have you ever wished your tools could talk to each other, seamlessly sharing data, automating repetitive tasks, and freeing you to focus on the work that truly matters? Imagine updating a CAD design … [+7431 chars]"
      },
      {
        "source": {
          "id": "fox-news",
          "name": "Fox News"
        },
        "author": null,
        "title": "Ethernet vs Wi-Fi security comparison reveals surprising results for home users seeking protection",
        "description": "Expert analysis reveals whether wired Ethernet or wireless Wi-Fi connections are safer for home internet use, plus practical steps to secure your network from attackers.",
        "url": "https://www.foxnews.com/tech/ethernet-vs-wi-fi-security-comparison-reveals-surprising-results-home-users-seeking-protection",
        "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/10/wifi-router-wireless-signal.jpg",
        "publishedAt": "2025-10-12T12:00:40Z",
        "content": "We spend so much time online that how we connect to the internet has become almost as important as the devices we use. Most people never give it a second thought. They connect their computer to Wi-Fi… [+7725 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "The Denver Post"
        },
        "author": "Aldo Svaldi",
        "title": "Stricter visa rules have Colorado employers that rely on foreign workers scrambling",
        "description": "The addition of a $100,000 application fee for new H-1B petitions could have significant implications for tech employers in states like Colorado, where younger and smaller firms dominate.",
        "url": "https://www.denverpost.com/2025/10/12/h1b-visas-trump-immigration-colorado-employers/",
        "urlToImage": "https://www.denverpost.com/wp-content/uploads/2025/10/TDP-L-FAGERBERG-PRODUCE_JAC5844.jpg?w=1024&h=797",
        "publishedAt": "2025-10-12T12:00:38Z",
        "content": "Iterate.ai has relied heavily on highly trained tech workers from around the globe to meet demand for its customized artificial intelligence agent systems, bringing some of them to the U.S. under the… [+18269 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "CNET"
        },
        "author": "Jesse Orrall",
        "title": "Humanoid Robots Headed to War? I Went Hands-On With the Phantom MK1",
        "description": "At Foundation's headquarters in San Francisco, I met the Phantom MK1 humanoid robot and controlled it using a VR headset. The CEO told me his aspirations to deploy the robot in factories, on battlefields and, someday, on Mars.",
        "url": "https://www.cnet.com/tech/computing/humanoid-robots-headed-to-war-hands-on-with-phantom-mk1/",
        "urlToImage": "https://www.cnet.com/a/img/resize/bf5fe1f28ee77d60a1a9061daaa235fd63d89452/hub/2025/10/10/d17c4522-563a-4ab4-b1db-2c5d9510255e/p1017015.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2025-10-12T12:00:03Z",
        "content": "In the increasingly crowded field of humanoid robotics, one thing that makes Foundation and its Phantom robot stand out is the company's embrace of the defense industry. That includes perhaps someday… [+608 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Tom's Hardware UK"
        },
        "author": "mylesgoldman@icloud.com (Myles Goldman) , Myles Goldman",
        "title": "Corsair Vanguard Pro 96 review: A 96-percent magnetic switch keyboard with a semi-customizable LCD screen",
        "description": "The Corsair Vanguard Pro 96 is a fun and impressive 96-percent mechanical keyboard. While at the time of review I was disappointed by the LCD screen’s lack of features at the time of review.",
        "url": "https://www.tomshardware.com/peripherals/gaming-keyboards/corsairvanguard-pro-96-review",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/kRKNwy44gBWECWRSs2hCpF-2560-80.jpg",
        "publishedAt": "2025-10-12T12:00:00Z",
        "content": "Why you can trust Tom's Hardware\r\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.Mechanical keyboards… [+9058 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Bradenkelley.com"
        },
        "author": "Pete Foley",
        "title": "AI, Cognitive Obesity and Arrested Development",
        "description": "GUEST POST from Pete Foley Some of the biggest questions of our age are whether AI will ultimately benefit or hurt us, and how big its’ effect will ultimately be. And that of course is a problem with any big, disruptive technology.  We want to anticipate how …",
        "url": "https://bradenkelley.com/2025/10/ai-cognitive-obesity-and-arrested-development/",
        "urlToImage": null,
        "publishedAt": "2025-10-12T12:00:00Z",
        "content": "GUEST POST from Pete Foley\r\nSome of the biggest questions of our age are whether AI will ultimately benefit or hurt us, and how big its’ effect will ultimately be.\r\nAnd that of course is a problem wi… [+18846 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "CNET"
        },
        "author": "Joe Supan",
        "title": "What I Learned Testing the Starlink Mini Deep in the Washington Wilderness",
        "description": "From my home office to the North Cascades wilderness, I tested out the Starlink Mini Dish for a week to see what it’s made of.",
        "url": "https://www.cnet.com/home/internet/what-i-learned-testing-the-starlink-mini-deep-in-the-washington-wilderness/",
        "urlToImage": "https://www.cnet.com/a/img/resize/2570446ad5409ab37d280e1da1afccc7fc106ca1/hub/2025/10/10/262075af-404b-4d72-90d3-db54fc7bb117/img-6602.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2025-10-12T12:00:00Z",
        "content": "On almost every hike or camping trip I take in Washington state, there's a moment on the drive when service drops, music cuts out in the car and texts stop coming in. That's when I start hoping I rem… [+14240 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Dubaichronicle.com"
        },
        "author": "Dubai Chronicle",
        "title": "Dubai Trackless Tram: The Future of Transport Is on the Move",
        "description": "Dubai has never waited for the future—it builds it. From the world’s first driverless metro in the region to flying taxi trials, the city is once again redefining mobility with a bold new project: the Dubai Trackless Tram. Elegant, efficient, and engineered f…",
        "url": "https://www.dubaichronicle.com/2025/10/12/dubai-trackless-tram-the-future-of-transport-is-on-the-move/",
        "urlToImage": "https://i0.wp.com/www.dubaichronicle.com/wp-content/uploads/2025/10/dubai_trackless_tram.jpg?fit=1024%2C1024&ssl=1",
        "publishedAt": "2025-10-12T11:52:06Z",
        "content": "Dubai has never waited for the futureit builds it. From the worlds first driverless metro in the region to flying taxi trials, the city is once again redefining mobility with a bold new project: the … [+4540 chars]"
      },
      {
        "source": {
          "id": "fox-news",
          "name": "Fox News"
        },
        "author": null,
        "title": "Australian construction robot Charlotte can 3D print 2,150-sq-ft home in one day using sustainable materials",
        "description": "Australian construction robot Charlotte uses sand, crushed brick and recycled glass to 3D print fireproof, floodproof homes with reduced carbon footprint.",
        "url": "https://www.foxnews.com/tech/australian-construction-robot-charlotte-can-3d-print-2150-sq-ft-home-one-day-using-sustainable-materials",
        "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/10/robot-3d-printing-home-desert.jpg",
        "publishedAt": "2025-10-12T11:51:46Z",
        "content": "Construction robots are no longer a far-off idea. They're already changing job sites by tackling repetitive, heavy, and often dangerous tasks. The latest robot comes from Australia, where a spider-li… [+4173 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Tampafp.com"
        },
        "author": "Danielle Shockey",
        "title": "Federal Judge Grants Unprecedented Anonymity In Voter Data Privacy Suit Against DHS, SSA",
        "description": "In a highly unusual move, a federal judge has granted five individual plaintiffs the right to proceed anonymously—even from the government defendants—in a",
        "url": "https://www.tampafp.com/federal-judge-grants-unprecedented-anonymity-in-voter-data-privacy-suit-against-dhs-ssa/",
        "urlToImage": "https://www.tampafp.com/wp-content/uploads/2022/05/Judge-Court-Law-Justice.jpeg",
        "publishedAt": "2025-10-12T11:50:27Z",
        "content": "In a highly unusual move, a federal judge has granted five individual plaintiffs the right to proceed anonymouslyeven from the government defendantsin a class-action lawsuit challenging the Departmen… [+3450 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Livemint"
        },
        "author": "Lata Jha",
        "title": "India emerges as IMDb’s second-largest market, after US—powered by multilingual storytelling",
        "description": "IMDb’s India audience has doubled in five years, with over 414,000 titles listed across 15+ languages, making the country its second-largest market after the US.",
        "url": "https://www.livemint.com/industry/media/india-emerges-as-imdb-s-second-largest-market-after-us-powered-by-multilingual-storytelling-11760252276996.html",
        "urlToImage": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/Yaminie_Patodia_1760252361529_1760252377157_1760269842216.jpg",
        "publishedAt": "2025-10-12T11:49:17Z",
        "content": "India, known for its rich entertainment ecosystem and linguistic diversity, is now the second-largest audience for IMDb, the Internet movie database owned by Amazon, after the United States. Over the… [+3707 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Notebookcheck.net"
        },
        "author": "Silvio Werner",
        "title": "Xiaomi to launch a new Poco tablet globally according to certifications",
        "description": "Xiaomi apparently has a new tablet in the pipeline. Development of the device appears to already be in the finishing stages, so a release is likely soon. The model is expected to feature cellular connectivity.",
        "url": "https://www.notebookcheck.net/Xiaomi-to-launch-a-new-Poco-tablet-globally-according-to-certifications.1136638.0.html",
        "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/csm_pocopad_3f437b5104.jpg",
        "publishedAt": "2025-10-12T11:49:00Z",
        "content": "Relatively reliable leaks come not only from insider information, but also from databases maintained by government agencies, such as those responsible for issuing declarations of device compliance. O… [+1257 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "BusinessLine"
        },
        "author": "Shishir Sinha",
        "title": "ICAI mulling ways to help desi firms to gain financial strength to compete with big four audit, accounting & advisory firms",
        "description": "“Indian firms getting ready to compete with big global firms will need to open more branches, employ more people; All these will require financial resource--ICAI is preparing a report to help in this direction”",
        "url": "https://www.thehindubusinessline.com/economy/icai-mulling-ways-to-help-desi-firms-to-gain-financial-strength-to-compete-with-big-four-audit-accounting-advisory-firms/article70154589.ece",
        "urlToImage": "https://bl-i.thgim.com/public/incoming/h76pce/article70154904.ece/alternates/LANDSCAPE_1200/IMG_BL25_Think_spreadshe_2_1_AQE9RGKH.jpg",
        "publishedAt": "2025-10-12T11:36:13Z",
        "content": ",\r\nIn order to facilitate the governments vision for developing big desi firms to compete with the big four audit, accounting and advisory firms, the Institute of Chartered Accounts of India (ICAI) o… [+3584 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Marketing-tutor.com"
        },
        "author": "Geoff Lord",
        "title": "Optimizing For AI-Generated Search Results: A Universal Guide | The Marketing Tutor",
        "description": "Enhancing Your Knowledge of AI-Driven Search Algorithms How Do AI Algorithms Effectively Process User Queries? AI-generated search algorithms employ a variety of sophisticated techniques to efficiently process user queries. Gaining a deeper understanding of t…",
        "url": "https://marketing-tutor.com/blog/optimizing-for-ai-generated-search-results-a-universal-guide/",
        "urlToImage": "https://marketing-tutor.com/blog/wp-content/uploads/2021/07/MT-Logo-260-x260.png",
        "publishedAt": "2025-10-12T11:34:32Z",
        "content": "Enhancing Your Knowledge of AI-Driven Search Algorithms\r\nHow Do AI Algorithms Effectively Process User Queries?\r\nAI-generated search algorithms employ a variety of sophisticated techniques to efficie… [+33862 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Harvard School of Engineering and Applied Sciences"
        },
        "author": "Andrew Oelz, Kenneth Markowitz, Stacey Mitchell, Andrew Oelz, Kenneth Markowitz, Stacey Mitchell",
        "title": "CARB Publishes Preliminary List of Companies Potentially Subject to SB 253 and SB 261",
        "description": "The California Air Resources Board (CARB) took a significant step forward recently in implementing the state’s climate disclosure laws: SB 253 (the Climate Corporate Data Accountability Act) and SB 261 (the Climate-Related Financial Risk Disclosure law), in e…",
        "url": "https://corpgov.law.harvard.edu/2025/10/12/carb-publishes-preliminary-list-of-companies-potentially-subject-to-sb-253-and-sb-261/",
        "urlToImage": "https://corpgov.law.harvard.edu/wp-content/uploads/2021/03/new-shield-facebook.png",
        "publishedAt": "2025-10-12T11:30:59Z",
        "content": "The California Air Resources Board (CARB) took a significant step forward recently in implementing the states climate disclosure laws: SB 253 (the Climate Corporate Data Accountability Act) and SB 26… [+5310 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Livemint"
        },
        "author": "Anubhav Mukherjee",
        "title": "China says Qualcomm admits failing to report Autotalks acquisition, antitrust probe threat looms over chipmaker",
        "description": "China stated that Qualcomm failed to report the Autotalks acquisition to the State Administration for Market Regulation (SAMR), prompting the authorities to initiate an antitrust investigation against Qualcomm on Friday.",
        "url": "https://www.livemint.com/companies/news/china-says-qualcomm-admits-failing-to-report-autotalks-acquisition-antitrust-probe-threat-looms-over-chipmaker-11760264149797.html",
        "urlToImage": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/QUALCOMM-BRITAIN-COURT-0_1760111700511_1760111710910_1760267595560.JPG",
        "publishedAt": "2025-10-12T11:30:36Z",
        "content": "China's State Administration for Market Regulation (SAMR) announced on Sunday, 12 October 2025, that the US-based chipmaking giant Qualcomm had admitted to not informing the Chinese authorities when … [+2292 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Tom's Hardware UK"
        },
        "author": "Mark Tyson",
        "title": "New HydroHaptic technology could have you squeezing, pinching, and twisting a pliable mouse or joystick",
        "description": "Computer scientists have revealed an innovative, expressive, two-way input peripheral technology dubbed HydroHaptics.",
        "url": "https://www.tomshardware.com/peripherals/controllers-gamepads/new-hydrohaptic-technology-could-have-you-squeezing-pinching-and-twisting-a-pliable-mouse-or-joystick",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/cvixvtRcRJ3QX2hmuADrdB-1920-80.jpg",
        "publishedAt": "2025-10-12T11:20:00Z",
        "content": "Computer scientists led by a team from the University of Bath have revealed an innovation they dub HydroHaptics. They say the new technology enables “expressive, two-way communication,” between the u… [+3447 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "BusinessLine"
        },
        "author": "ANI",
        "title": "EY, Microsoft launch AI Skills Passport to prepare India's youth for AI-driven future",
        "description": "The AI Skills Passport is part of a global effort that has already seen over 40,000 participants and 13,000 completions worldwide",
        "url": "https://www.thehindubusinessline.com/info-tech/ey-microsoft-launch-ai-skills-passport-to-prepare-indias-youth-for-ai-driven-future/article70154856.ece",
        "urlToImage": "https://bl-i.thgim.com/public/incoming/h3e84k/article70154873.ece/alternates/LANDSCAPE_1200/image%208.jpg",
        "publishedAt": "2025-10-12T11:16:56Z",
        "content": "EY and Microsoft have launched the AI Skills Passport, a free online learning program designed to build essential artificial intelligence (AI) capabilities among students and early-career professiona… [+2745 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "New Atlas"
        },
        "author": "David Szondy",
        "title": "Fusion device fires “super-lightning” pulses 12 times a minute",
        "description": "Living up to its name, University of Washington spin-off company ZAP Energy's Century system is developing fusion power technology by blasting plasma with super-lightning-like pulses 12 times per minute, without relying on superconducting magnets or laser bea…",
        "url": "https://newatlas.com/energy/z-pinch-fusion-device-lighting-bolts/",
        "urlToImage": "https://assets.newatlas.com/dims4/default/2065789/2147483647/strip/true/crop/1800x945+0+128/resize/1200x630!/quality/90/?url=https%3A%2F%2Fnewatlas-brightspot.s3.amazonaws.com%2F9f%2F82%2F5cab52c541169d72940462e10df7%2F68d5768eb2b150ada8a851b1-century-39kw-lead.jpg&na.image_optimisation=0",
        "publishedAt": "2025-10-12T11:03:00Z",
        "content": "Living up to its name, University of Washington spin-off company ZAP Energy's Century system is developing fusion power technology by blasting plasma with super-lightning-like pulses 12 times per min… [+2965 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Forbes"
        },
        "author": "Gene Marks, Contributor, \n Gene Marks, Contributor\n https://www.forbes.com/sites/quickerbettertech/",
        "title": "This Week In Small Business Technology News: Apps Can Be Used Inside Of ChatGPT And A Big New Microsoft Teams Feature",
        "description": "ChatGPT now has apps inside, Microsoft Teams gets a productivity boost, Perplexity says its Comet AI browser boost productivity and Talkdesk has a customer service survey.",
        "url": "https://www.forbes.com/sites/quickerbettertech/2025/10/12/this-week-in-small-business-technology-news-apps-can-be-used-inside-of-chatgpt-and-a-big-new-microsoft-teams-feature/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68e981043f75ec435f38c911/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "SAN FRANCISCO, CALIFORNIA - NOVEMBER 06: OpenAI CEO Sam Altman speaks during the OpenAI DevDay event on November 06, 2023 in San Francisco, California. Altman delivered the keynote address at the fir… [+5483 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Yahoo Entertainment"
        },
        "author": "Vawn Himmelsbach",
        "title": "‘Youngism’ is the biggest threat Gen Z workers face right now, says leadership expert — and its effects are ‘startling’",
        "description": "Younger workers are questioned, dismissed and stereotyped — here’s how they can fight back.",
        "url": "https://finance.yahoo.com/news/youngism-biggest-threat-gen-z-110000347.html",
        "urlToImage": "https://media.zenfs.com/en/moneywise_327/51218ee10537f4258f1d215f724403fb",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "While Gen Z workers might be worried about how AI will impact the job market, its not the only threat to building a career.\r\nWhile older workers may face discrimination in the workplace being passed … [+6247 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Live Science"
        },
        "author": "Larissa G. Capella",
        "title": "Physicists capture rare illusion of an object moving at 99.9% the speed of light",
        "description": "For the first time, physicists have simulated what objects moving near the speed of light would look like — an optical illusion called the Terrell-Penrose effect.",
        "url": "https://www.livescience.com/physics-mathematics/physicists-capture-rare-illusion-of-an-object-moving-at-99-9-percent-the-speed-of-light",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/k24Ej2rVn54LYAFtJBumEi-1920-80.jpg",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "Using ultra-fast laser pulses and special cameras, scientists have simulated an optical illusion that appears to defy Einstein's theory of special relativity\r\n.\r\nOne consequence of special relativity… [+4089 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Rigzone"
        },
        "author": "Jov Onsat",
        "title": "Eni Progresses Permit Process for Its 2nd Biorefinery in Sicily",
        "description": "Designed to produce up to 500,000 MMtpa of HVO diesel and SAF, the Priolo project will rise on the site of an Eni ethylene plant set to be decommissioned.",
        "url": "https://www.rigzone.com/news/eni_progresses_permit_process_for_its_2nd_biorefinery_in_sicily-12-oct-2025-182049-article/",
        "urlToImage": "https://images.rigzone.com/images/news/articles/Eni-Progresses-Permit-Process-for-Its-2nd-Biorefinery-in-Sicily-182049-1200x628.png",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "Eni SpA said Thursday it had launched the authorization process for an Environmental Impact Assessment to build a biorefinery and a chemical recycling plant in Sicily, after receiving approval from I… [+3730 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Wccftech"
        },
        "author": "Alessio Palumbo",
        "title": "New Age of Empires Games Are Seemingly Powered by Unreal Engine 5",
        "description": "According to a job listing posted this week, a new Age of Empires game is in development at World's Edge. This, by itself, is no big surprise, since Microsoft's historic real-time strategy franchise has enjoyed a quiet renaissance in the last few years. Betwe…",
        "url": "https://wccftech.com/new-age-of-empires-games-seemingly-powered-by-unreal-engine-5/",
        "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/10/Age_of_Empires_Series-HD-scaled.jpeg",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "According to a job listing posted this week, a new Age of Empires game is in development at World's Edge. This, by itself, is no big surprise, since Microsoft's historic real-time strategy franchise … [+2239 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Touringplans.com"
        },
        "author": "Jennifer Heymont",
        "title": "TouringPlans Travel Beat 10-12-2025",
        "description": "At Travel Beat we have all the “other” news from the last week or so—the stuff that wasn’t big enough to stop the presse",
        "url": "https://touringplans.com/blog/touringplans-travel-beat-10-12-2025/",
        "urlToImage": "https://blog-cdn.touringplans.com/blog/wp-content/uploads/2025/10/Chelsea-Row-Houses-Travel-Beat-cover.jpg",
        "publishedAt": "2025-10-12T11:00:00Z",
        "content": "At Travel Beat we have all the other news from the last week or sothe stuff that wasnt big enough to stop the presses for. What did the newsroom bring us this week? (Sneak peek: It was a banger!) Bul… [+14340 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "BusinessLine"
        },
        "author": "ANI",
        "title": "China's upcoming strategic rail link near LAC has security concerns, warn Tibetan experts",
        "description": "China's new railway line in Tibet raises concerns over military implications for India, boosting Chinese influence in the region.",
        "url": "https://www.thehindubusinessline.com/economy/logistics/chinas-upcoming-strategic-rail-link-near-lac-has-security-concerns-warn-tibetan-experts/article70154774.ece",
        "urlToImage": "https://bl-i.thgim.com/public/incoming/mp5431/article70154819.ece/alternates/LANDSCAPE_1200/2025-01-20T110310Z_1586405703_RC2MDCASMB1H_RTRMADP_3_INDIA-TRANSPORT-BUDGET.JPG",
        "publishedAt": "2025-10-12T10:56:29Z",
        "content": "China has begun work on a new strategic railway line connecting Tibet to the Chinese city of Lhasa, a route that runs close to the Line of Actual Control (LAC), sparking fresh concerns over its poten… [+3428 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Weandthecolor.com"
        },
        "author": null,
        "title": "Graphic Design Trends 2026: Ten Bold Directions Shaping Creativity",
        "description": "As 2026 draws near, the conversation around graphic design trends extends well beyond what was defined in 2025. Rapid developments in generative technology, growing demands for sustainability, and...",
        "url": "https://tumblr.weandthecolor.com/post/797196982740484096/graphic-design-trends-2026-ten-bold-directions",
        "urlToImage": "https://64.media.tumblr.com/1350596069fc2b5772799d058f2c7bbe/dd5b7e0e0378ce1d-db/s1280x1920/5f18df572142f62506ba560da4bf3608093e2645.webp",
        "publishedAt": "2025-10-12T10:51:27Z",
        "content": "As 2026 draws near, the conversation around graphic design trends extends well beyond what was defined in 2025. Rapid developments in generative technology, growing demands for sustainability, and ev… [+673 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Nep123.com"
        },
        "author": "Editor",
        "title": "MAW Vriddhi EV Exchange Carnival",
        "description": "MAW Vriddhi Launches Mega Exchange Carnival for Electric Vehicles in Kathmandu Looking to upgrade your ride to a stylish and technologically advanced EV this festive season? MAW Vriddhi, a leading automobile group in Nepal, has launched a mega exchange carniv…",
        "url": "https://nep123.com/maw-vriddhi-ev-exchange-carnival/",
        "urlToImage": "https://nep123.com/wp-content/uploads/2025/09/basantapur_featured.jpg",
        "publishedAt": "2025-10-12T10:50:10Z",
        "content": "MAW Vriddhi Launches Mega Exchange Carnival for Electric Vehicles in Kathmandu\r\nLooking to upgrade your ride to a stylish and technologically advanced EV this festive season? MAW Vriddhi, a leading a… [+1745 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Weandthecolor.com"
        },
        "author": "Dirk Petzold",
        "title": "Graphic Design Trends 2026: Ten Bold Directions Shaping Creativity",
        "description": "As 2026 approaches, the conversation around graphic design trends goes far beyond 2025. Rapid advances in generative technology, rising expectations around sustainability, and fresh perspectives on inclusivity are reshaping visual culture. Designers can’t sim…",
        "url": "https://weandthecolor.com/graphic-design-trends-2026-ten-bold-directions-shaping-creativity/206176",
        "urlToImage": "https://weandthecolor-21f52.kxcdn.com/wp-content/uploads/2025/10/Top-10-Graphic-Design-Trends-2026.webp",
        "publishedAt": "2025-10-12T10:42:44Z",
        "content": "As 2026 approaches, the conversation around graphic design trends goes far beyond 2025. Rapid advances in generative technology, rising expectations around sustainability, and fresh perspectives on i… [+15810 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Speckyboy.com"
        },
        "author": "Eric Karkovack",
        "title": "Why The Grumpy Designer Is Wary of AI’s Confidence",
        "description": "AI speaks with confidence, but that doesn’t mean it’s right. The Grumpy Designer explores why self-assured answers can mislead users and what AI tools should do instead.\nThe post Why The Grumpy Designer Is Wary of AI’s Confidence appeared first on Speckyboy D…",
        "url": "https://speckyboy.com/grumpy-designer-iwary-of-ais-confidence/",
        "urlToImage": "https://speckyboy.com/wp-content/uploads/2025/09/ai-confidence-thumb.webp",
        "publishedAt": "2025-10-12T10:37:17Z",
        "content": "Confidence is a funny thing. I struggled with it as a child. I didnt believe I was good enough to excel in school or athletics. Even so, I was a terrific partner in pop-culture trivia.\r\nGrowing up to… [+6365 chars]"
      },
      {
        "source": {
          "id": "the-times-of-india",
          "name": "The Times of India"
        },
        "author": "ANI",
        "title": "China's upcoming strategic rail link from Tibet to Lhasa near LAC, big security concern for India, warn Tibetan experts",
        "description": "China is constructing a new strategic railway line connecting Tibet to Lhasa, running close to the Line of Actual Control (LAC). This project, expected within five years, aims to boost military logistics and resource exploitation, raising security concerns fo…",
        "url": "https://economictimes.indiatimes.com/news/defence/chinas-upcoming-strategic-rail-link-from-tibet-to-lhasa-near-lac-big-security-concern-for-india-warn-tibetan-experts/articleshow/124499596.cms",
        "urlToImage": "https://img.etimg.com/thumb/msid-124499619,width-1200,height-630,imgsize-48748,overlay-etdefence/articleshow.jpg",
        "publishedAt": "2025-10-12T10:35:22Z",
        "content": "Dharamshala: China has begun work on a new strategic railway line connecting Tibet to the Chinese city of Lhasa, a route that runs close to the Line of Actual Control (LAC), sparking fresh concerns o… [+3457 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Android Authority"
        },
        "author": "Hadlee Simons",
        "title": "7 features you should expect from 2026 flagship Android phones",
        "description": "From super-dim displays to higher-quality 200MP photos, here's what to expect from 2026's flagship Android phones.",
        "url": "https://www.androidauthority.com/2026-flagship-android-phones-features-expect-3605296/",
        "urlToImage": "https://www.androidauthority.com/wp-content/uploads/2025/06/OnePlus-13-vs-Galaxy-S25-Ultra-vs-Pixel-9-Pro-XL-front-on.jpg",
        "publishedAt": "2025-10-12T10:30:05Z",
        "content": "This was a significant year for Android phones, as several innovations and improvements were keenly felt. Whether its the Snapdragon 8 Elites huge CPU performance leap, the continued rise of silicon-… [+7787 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Ritholtz.com"
        },
        "author": "Barry Ritholtz",
        "title": "10 Sunday Reads",
        "description": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures: • Who maintains the scaffolding of freedom? The prosperity the western world enjoyed for decades was the result of ideas, specifically classical liberal ideas about free …",
        "url": "https://ritholtz.com/2025/10/10-sunday-reads-203/",
        "urlToImage": "https://ritholtz.com/wp-content/uploads/2026/12/apps.png",
        "publishedAt": "2025-10-12T10:30:03Z",
        "content": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures:Who maintains the scaffolding of freedom? The prosperity the western world enjoyed for decades was the result o… [+4527 chars]"
      },
      {
        "source": {
          "id": "nbc-news",
          "name": "NBC News"
        },
        "author": "Jared Perlo",
        "title": "Are deepfakes of dead people rewriting the past?",
        "description": "While Sora has some guardrails around the likenesses of living people, protections around the likenesses of those who have died appear to be an afterthought.",
        "url": "https://www.nbcnews.com/tech/tech-news/are-deepfakes-dead-people-rewriting-rcna235982",
        "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-10/251006-Sora-2-openai-aa-237-1e9e42.jpg",
        "publishedAt": "2025-10-12T10:30:00Z",
        "content": "OpenAIs new text-to-video app, Sora, was supposed to be a social AI playground, allowing users to create imaginative AI videos of themselves, friends and celebrities while building off of others idea… [+8805 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Livemint"
        },
        "author": "Arun Maira",
        "title": "It’s time for economists and policymakers to take a wider view of our national assets and growth drivers",
        "description": "China’s economy has outperformed India’s and our post-1991 policy approach cannot escape its share of blame. Our industrial gap with China demands that we nudge our policymakers to broaden their perspective of what matters. National assets, for example, if ac…",
        "url": "https://www.livemint.com/opinion/online-views/india-china-trade-imbalance-indian-manufacturing-industrial-policy-debate-capital-goods-sector-production-gdp-jobs-fuel-11759996225549.html",
        "urlToImage": "https://www.livemint.com/lm-img/img/2025/10/12/1600x900/india_china_1760264133266_1760264133482.jpeg",
        "publishedAt": "2025-10-12T10:17:07Z",
        "content": "India has become strategically vulnerable, caught between the US and China. Chinas capital goods production sector has grown 50 times larger than Indias since the liberalization of our economy, when … [+5921 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Yahoo Entertainment"
        },
        "author": "Simply Wall St",
        "title": "Does Serve Robotics' DoorDash Partnership Challenge Uber’s Delivery Ambitions and Ecosystem Advantage (UBER)?",
        "description": "Serve Robotics announced the launch of its sidewalk robot delivery service across 14 Chicago neighborhoods in collaboration with Uber Eats, building on...",
        "url": "https://finance.yahoo.com/news/does-serve-robotics-doordash-partnership-101020040.html",
        "urlToImage": "https://media.zenfs.com/en/simply_wall_st__316/cfa0f05cef7298ff8df3db38405f2803",
        "publishedAt": "2025-10-12T10:10:20Z",
        "content": "<ul><li>Serve Robotics announced the launch of its sidewalk robot delivery service across 14 Chicago neighborhoods in collaboration with Uber Eats, building on previous rollouts in Los Angeles, Miami… [+3752 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Yahoo Entertainment"
        },
        "author": "Sam Boughedda",
        "title": "Fusion power is now a matter of ’when’ not ’if’",
        "description": "Investing.com -- After gaining insights from a fireside chat with Bob Mumgaard, chief executive of Commonwealth Fusion Systems (CFS), Kepler Cheuvreux said...",
        "url": "https://finance.yahoo.com/news/fusion-power-now-matter-not-100505447.html",
        "urlToImage": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
        "publishedAt": "2025-10-12T10:05:05Z",
        "content": "Investing.com -- After gaining insights from a fireside chat with Bob Mumgaard, chief executive of Commonwealth Fusion Systems (CFS), Kepler Cheuvreux said in a note this week that fusion power is no… [+1625 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "The Star Online"
        },
        "author": "The Star Online",
        "title": "Malaysia to take part in UNTCC chiefs' conclave in New Delhi",
        "description": "KUALA LUMPUR: Malaysia has confirmed its participation in the United Nations Troop Contributing Countries' (UNTCC) Chiefs' Conclave in New Delhi, which will bring together senior military leaders from 32 nations to discuss measures to strengthen United Nation…",
        "url": "https://www.thestar.com.my/news/nation/2025/10/12/malaysia-to-take-part-in-untcc-chiefs039-conclave-in-new-delhi",
        "urlToImage": "https://apicms.thestar.com.my/uploads/images/2025/10/12/3566783.jpg",
        "publishedAt": "2025-10-12T10:04:00Z",
        "content": "KUALA LUMPUR: Malaysia has confirmed its participation in the United Nations Troop Contributing Countries' (UNTCC) Chiefs' Conclave in New Delhi, which will bring together senior military leaders fro… [+3110 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Futurism"
        },
        "author": "Maggie Harrison Dupré",
        "title": "Numerous Billionaires Preparing for End of Society",
        "description": "Guns, gold, and bunkers galore.\nThe post Numerous Billionaires Preparing for End of Society appeared first on Futurism.",
        "url": "https://futurism.com/artificial-intelligence/billionaires-preparing-for-end",
        "urlToImage": "https://futurism.com/wp-content/uploads/2025/10/billionaires-preparing-for-end.jpg?quality=85&w=1200",
        "publishedAt": "2025-10-12T10:00:00Z",
        "content": "The tech billionaires are still doomsday prepping. And as the BBC reports, it seems that AI is making some of them more paranoid than ever that society as we know it might soon crumble.\r\nFor years no… [+4568 chars]"
      },
      {
        "source": {
          "id": null,
          "name": "Notebookcheck.net"
        },
        "author": "Anmol Dubey",
        "title": "Apple’s entire M5 Mac lineup reportedly leaks: full timeline, models, and specifications",
        "description": "Apple’s full M5 Mac roadmap has reportedly leaked, revealing upcoming MacBook and desktop models ranging from the M5 Pro and Air to the iMac and Mac Studio. The report outlines the expected launch timeline, key specifications, and what to expect from each dev…",
        "url": "https://www.notebookcheck.net/Apple-s-entire-M5-Mac-lineup-reportedly-leaks-full-timeline-models-and-specifications.1136516.0.html",
        "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/apple-mac-lineup-collage-macbook-pro-air-mac-mini-notebookcheck.jpg",
        "publishedAt": "2025-10-12T09:56:00Z",
        "content": "The key difference is the new M5 chip, which, based on early iPad Pro benchmark results, appears to deliver significantly higher GPU performance compared to the M4. No major design changes are expect… [+2192 chars]"
      }
    ]
  }
}